Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAB169.PIC
      <edc:SFRDef edc:_addr="0x1F84B0A4" edc:_begin="0x64" edc:_end="0x6c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="15" edc:access="-------------------rrrrrnnrnnnnn" edc:cname="ADCCMPCON2" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCCMPCON2" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:mask="0x1" edc:name="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:mask="0x1" edc:name="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:mask="0x1" edc:name="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:mask="0x1" edc:name="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:mask="0x1" edc:name="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:mask="0x1" edc:name="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:mask="0x1" edc:name="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:mask="0x1" edc:name="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:mask="0x1f" edc:name="AINID" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0A8" edc:_begin="0x68" edc:_end="0x6c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="16" edc:access="-------------------rrrrrnnrnnnnn" edc:cname="ADCCMPCON3" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCCMPCON3" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:mask="0x1" edc:name="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:mask="0x1" edc:name="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:mask="0x1" edc:name="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:mask="0x1" edc:name="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:mask="0x1" edc:name="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:mask="0x1" edc:name="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:mask="0x1" edc:name="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:mask="0x1" edc:name="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:mask="0x1f" edc:name="AINID" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0AC" edc:_begin="0x68" edc:_end="0x6c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="17" edc:access="-------------------rrrrrnnrnnnnn" edc:cname="ADCCMPCON4" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCCMPCON4" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:mask="0x1" edc:name="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:mask="0x1" edc:name="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:mask="0x1" edc:name="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:mask="0x1" edc:name="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:mask="0x1" edc:name="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:mask="0x1" edc:name="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:mask="0x1" edc:name="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:mask="0x1" edc:name="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:mask="0x1f" edc:name="AINID" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0B0" edc:_begin="0x68" edc:_end="0x6c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="18" edc:access="-------------------rrrrrnnrnnnnn" edc:cname="ADCCMPCON5" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCCMPCON5" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:mask="0x1" edc:name="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:mask="0x1" edc:name="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:mask="0x1" edc:name="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:mask="0x1" edc:name="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:mask="0x1" edc:name="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:mask="0x1" edc:name="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:mask="0x1" edc:name="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:mask="0x1" edc:name="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:mask="0x1f" edc:name="AINID" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0B4" edc:_begin="0x68" edc:_end="0x6c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="19" edc:access="-------------------rrrrrnnrnnnnn" edc:cname="ADCCMPCON6" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCCMPCON6" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:mask="0x1" edc:name="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:mask="0x1" edc:name="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:mask="0x1" edc:name="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:mask="0x1" edc:name="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:mask="0x1" edc:name="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:mask="0x1" edc:name="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:mask="0x1" edc:name="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:mask="0x1" edc:name="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:mask="0x1f" edc:name="AINID" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0B8" edc:_begin="0x6c" edc:_end="0x78" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="20" edc:access="n--nnnnnnrr-----rrrrrrrrr----nnn" edc:cname="ADCFSTAT" edc:desc="" edc:impl="0x9fe0ff87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00000000-----000000000----000" edc:name="ADCFSTAT" edc:nzwidth="32" edc:por="0--00000000-----000000000----000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCID" edc:mask="0x7" edc:name="ADCID" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSIGN" edc:mask="0x1" edc:name="FSIGN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCNT" edc:mask="0xff" edc:name="FCNT" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FWROVERR" edc:mask="0x1" edc:name="FWROVERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRDY" edc:mask="0x1" edc:name="FRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIEN" edc:mask="0x1" edc:name="FIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0EN" edc:mask="0x1" edc:name="ADC0EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1EN" edc:mask="0x1" edc:name="ADC1EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2EN" edc:mask="0x1" edc:name="ADC2EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3EN" edc:mask="0x1" edc:name="ADC3EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4EN" edc:mask="0x1" edc:name="ADC4EN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FEN" edc:mask="0x1" edc:name="FEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0BC" edc:_begin="0x6c" edc:_end="0x78" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCFIFO" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCFIFO" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0C0" edc:_begin="0x6c" edc:_end="0x78" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ADCBASE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ADCBASE" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCBASE" edc:mask="0xffff" edc:name="ADCBASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B0C4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F84B0D0" edc:_begin="0x84" edc:_end="0x88" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="21" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCTRGSNS" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="ADCTRGSNS" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LVL0" edc:mask="0x1" edc:name="LVL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL1" edc:mask="0x1" edc:name="LVL1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL2" edc:mask="0x1" edc:name="LVL2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL3" edc:mask="0x1" edc:name="LVL3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL4" edc:mask="0x1" edc:name="LVL4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL5" edc:mask="0x1" edc:name="LVL5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL6" edc:mask="0x1" edc:name="LVL6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL7" edc:mask="0x1" edc:name="LVL7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL8" edc:mask="0x1" edc:name="LVL8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL9" edc:mask="0x1" edc:name="LVL9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL10" edc:mask="0x1" edc:name="LVL10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL11" edc:mask="0x1" edc:name="LVL11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
